<a href="https://colab.research.google.com/github/neethj/feature-engineering/blob/main/handling_categorical_data_part2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


##ordinal number encoding

In ordinal encoding, each unique category value is assigned an integer value. For example, “red” is 1, “green” is 2, and “blue” is 3

In [ ]:
import datetime

In [ ]:
datetime.datetime.today()

datetime.datetime(2021, 11, 16, 6, 19, 14, 440148)

In [ ]:
todaydate = datetime.datetime.today()

In [ ]:
#date is reduced by 2 days before
todaydate-datetime.timedelta(2)

datetime.datetime(2021, 11, 14, 6, 18, 59, 589143)

In [ ]:
## so what we want to do is to create data for date of 15 days,
##list comprehension
dates = [todaydate-datetime.timedelta(x) for x in range(15)]

In [ ]:
import numpy as np
import pandas as pd
data = pd.DataFrame(dates)

In [ ]:
data.columns = ["Day"]

In [ ]:
data.head()

                         Day
0 2021-11-16 06:18:59.589143
1 2021-11-15 06:18:59.589143
2 2021-11-14 06:18:59.589143
3 2021-11-13 06:18:59.589143
4 2021-11-12 06:18:59.589143

In [ ]:
data['weekday']=data['Day'].dt.day_name()

In [ ]:
data.head()

                         Day   weekday
0 2021-11-16 06:18:59.589143   Tuesday
1 2021-11-15 06:18:59.589143    Monday
2 2021-11-14 06:18:59.589143    Sunday
3 2021-11-13 06:18:59.589143  Saturday
4 2021-11-12 06:18:59.589143    Friday

In [ ]:
dictionary = {'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [ ]:
data["Date_ordinal"]=data['weekday'].map(dictionary)

In [ ]:
data.head()

                         Day   weekday  Date_ordinal
0 2021-11-16 06:18:59.589143   Tuesday             2
1 2021-11-15 06:18:59.589143    Monday             1
2 2021-11-14 06:18:59.589143    Sunday             7
3 2021-11-13 06:18:59.589143  Saturday             6
4 2021-11-12 06:18:59.589143    Friday             5

## count or frequency encoding

In [3]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [2]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_excel("/content/gdrive/MyDrive/kaggle/Athletes.xlsx")

In [ ]:
df.head()

                Name     NOC           Discipline
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [ ]:
df["NOC"].value_counts()

United States of America         615
Japan                            586
Australia                        470
People's Republic of China       401
Germany                          400
                                ...
St Vincent and the Grenadines      2
Nauru                              2
Dominica                           2
Lesotho                            2
United Republic of Tanzania        2
Name: NOC, Length: 206, dtype: int64

In [ ]:
country_map = df["NOC"].value_counts().to_dict()
country_map

{'Afghanistan': 5,
 'Albania': 8,
 'Algeria': 41,
 'American Samoa': 5,
 'Andorra': 2,
 'Angola': 20,
 'Antigua and Barbuda': 6,
 'Argentina': 180,
 'Armenia': 16,
 'Aruba': 3,
 'Australia': 470,
 'Austria': 72,
 'Azerbaijan': 41,
 'Bahamas': 16,
 'Bahrain': 31,
 'Bangladesh': 6,
 'Barbados': 7,
 'Belarus': 104,
 'Belgium': 125,
 'Belize': 3,
 'Benin': 7,
 'Bermuda': 2,
 'Bhutan': 3,
 'Bolivia': 5,
 'Bosnia and Herzegovina': 7,
 'Botswana': 13,
 'Brazil': 291,
 'Brunei Darussalam': 2,
 'Bulgaria': 41,
 'Burkina Faso': 7,
 'Burundi': 6,
 'Cambodia': 3,
 'Cameroon': 11,
 'Canada': 368,
 'Cape Verde': 6,
 'Cayman Islands': 5,
 'Central African Republic': 2,
 'Chad': 3,
 'Chile': 56,
 'Chinese Taipei': 67,
 'Colombia': 64,
 'Comoros': 3,
 'Congo': 3,
 'Cook Islands': 6,
 'Costa Rica': 13,
 'Croatia': 57,
 'Cuba': 69,
 'Cyprus': 14,
 'Czech Republic': 117,
 "Côte d'Ivoire": 29,
 'Democratic Republic of Timor-Leste': 3,
 'Democratic Republic of the Congo': 7,
 'Denmark': 103,
 'Djibouti': 4,
 'Dominica': 2,
 'Dominican Republic': 61,
 'Ecuador': 46,
 'Egypt': 133,
 'El Salvador': 5,
 'Equatorial Guinea': 3,
 'Eritrea': 13,
 'Estonia': 33,
 'Eswatini': 4,
 'Ethiopia': 42,
 'Federated States of Micronesia': 3,
 'Fiji': 28,
 'Finland': 45,
 'France': 377,
 'Gabon': 5,
 'Gambia': 3,
 'Georgia': 35,
 'Germany': 400,
 'Ghana': 14,
 'Great Britain': 366,
 'Greece': 75,
 'Grenada': 6,
 'Guam': 5,
 'Guatemala': 22,
 'Guinea': 5,
 'Guinea-Bissau': 4,
 'Guyana': 7,
 'Haiti': 6,
 'Honduras': 25,
 'Hong Kong, China': 40,
 'Hungary': 155,
 'Iceland': 4,
 'India': 117,
 'Indonesia': 26,
 'Iraq': 4,
 'Ireland': 116,
 'Islamic Republic of Iran': 66,
 'Israel': 85,
 'Italy': 356,
 'Jamaica': 60,
 'Japan': 586,
 'Jordan': 11,
 'Kazakhstan': 92,
 'Kenya': 78,
 'Kiribati': 3,
 'Kosovo': 10,
 'Kuwait': 10,
 'Kyrgyzstan': 16,
 "Lao People's Democratic Republic": 4,
 'Latvia': 29,
 'Lebanon': 6,
 'Lesotho': 2,
 'Liberia': 3,
 'Libya': 4,
 'Liechtenstein': 5,
 'Lithuania': 37,
 'Luxembourg': 11,
 'Madagascar': 6,
 'Malawi': 5,
 'Malaysia': 29,
 'Maldives': 4,
 'Mali': 4,
 'Malta': 6,
 'Marshall Islands': 2,
 'Mauritania': 2,
 'Mauritius': 7,
 'Mexico': 155,
 'Monaco': 6,
 'Mongolia': 43,
 'Montenegro': 35,
 'Morocco': 48,
 'Mozambique': 8,
 'Myanmar': 2,
 'Namibia': 11,
 'Nauru': 2,
 'Nepal': 5,
 'Netherlands': 274,
 'New Zealand': 202,
 'Nicaragua': 8,
 'Niger': 7,
 'Nigeria': 59,
 'North Macedonia': 8,
 'Norway': 92,
 'Oman': 5,
 'Pakistan': 10,
 'Palau': 3,
 'Palestine': 4,
 'Panama': 9,
 'Papua New Guinea': 7,
 'Paraguay': 8,
 "People's Republic of China": 401,
 'Peru': 33,
 'Philippines': 18,
 'Poland': 195,
 'Portugal': 85,
 'Puerto Rico': 35,
 'Qatar': 14,
 'ROC': 318,
 'Refugee Olympic Team': 26,
 'Republic of Korea': 223,
 'Republic of Moldova': 19,
 'Romania': 99,
 'Rwanda': 5,
 'Saint Kitts and Nevis': 2,
 'Saint Lucia': 5,
 'Samoa': 8,
 'San Marino': 4,
 'Sao Tome and Principe': 3,
 'Saudi Arabia': 32,
 'Senegal': 9,
 'Serbia': 83,
 'Seychelles': 5,
 'Sierra Leone': 4,
 'Singapore': 23,
 'Slovakia': 38,
 'Slovenia': 51,
 'Solomon Islands': 3,
 'Somalia': 2,
 'South Africa': 171,
 'South Sudan': 2,
 'Spain': 324,
 'Sri Lanka': 9,
 'St Vincent and the Grenadines': 2,
 'Sudan': 5,
 'Suriname': 3,
 'Sweden': 129,
 'Switzerland': 115,
 'Syrian Arab Republic': 6,
 'Tajikistan': 8,
 'Thailand': 39,
 'Togo': 4,
 'Tonga': 5,
 'Trinidad and Tobago': 31,
 'Tunisia': 57,
 'Turkey': 102,
 'Turkmenistan': 8,
 'Tuvalu': 2,
 'Uganda': 24,
 'Ukraine': 152,
 'United Arab Emirates': 4,
 'United Republic of Tanzania': 2,
 'United States of America': 615,
 'Uruguay': 11,
 'Uzbekistan': 63,
 'Vanuatu': 2,
 'Venezuela': 43,
 'Vietnam': 17,
 'Virgin Islands, British': 3,
 'Virgin Islands, US': 4,
 'Yemen': 3,
 'Zambia': 29,
 'Zimbabwe': 5}

here in this scenario it doesnt make sense to replace the country name with the number but this can be used in some situations, just know the method .
HERE OUR MAIN OBJECTIVE was to convert the NOC into integer values, that is what is meant by handling categorical data

In [ ]:
df["NOC"] = df["NOC"].map(country_map)

In [ ]:
df.head(10)

                Name  NOC           Discipline
0    AALERUD Katrine   92         Cycling Road
1        ABAD Nestor  324  Artistic Gymnastics
2  ABAGNALE Giovanni  356               Rowing
3     ABALDE Alberto  324           Basketball
4      ABALDE Tamara  324           Basketball
5          ABALO Luc  377             Handball
6       ABAROA Cesar   56               Rowing
7      ABASS Abobakr    5             Swimming
8   ABBASALI Hamideh   66               Karate
9      ABBASOV Islam   41            Wrestling

#### Advantages
Easy To Use
Not increasing feature space 
##### Disadvantages
It will provide same weight if the frequencies are same

## target guideded ordinal encoding
1. ordering labels according to target
2. we may replace the labels by the joint probablility of being 1 or 0

In [5]:
df = pd.read_csv("/content/gdrive/MyDrive/kaggle/titanic.zip (Unzipped Files)/train.csv", usecols=["Survived","Cabin"])

In [6]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [7]:
df["Cabin"] = df["Cabin"].fillna("Missing")

In [8]:
## here the cabin column shows the cabin section and the number of  the seat etc, so whats important in this column is the cabin sections. so we can get
## rid of the number after thecabin section

In [9]:
df["Cabin"] = df["Cabin"].astype(str).str[0]

In [10]:
df.head(10)

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M
5         0     M
6         0     E
7         0     M
8         1     M
9         1     M

In [11]:
df["Cabin"].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [12]:
df["Cabin"].value_counts()

M    687
C     59
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin, dtype: int64

In [13]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [14]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [15]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [16]:
enumerate(ordinal_labels,0)

In [17]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'A': 2, 'B': 6, 'C': 4, 'D': 8, 'E': 7, 'F': 5, 'G': 3, 'M': 1, 'T': 0}

In [19]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

In [ ]:
## kind off difficult to understand the code

## mean encoding

just like target guided encoding , but here we replace it with the mean

In [21]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [22]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [23]:
df["mean_encode"] = df["Cabin"].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_encode
0         0     M                     1     0.299854
1         1     C                     4     0.593220
2         1     M                     1     0.299854
3         1     C                     4     0.593220
4         0     M                     1     0.299854